In [17]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

In [36]:
engine = create_engine('mysql+pymysql://root@localhost/my-company', echo=True)

In [37]:
engine.table_names()

2021-12-11 00:12:48,396 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'sql_mode'
2021-12-11 00:12:48,396 INFO sqlalchemy.engine.base.Engine {}
2021-12-11 00:12:48,398 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2021-12-11 00:12:48,398 INFO sqlalchemy.engine.base.Engine {}
2021-12-11 00:12:48,400 INFO sqlalchemy.engine.base.Engine SELECT DATABASE()
2021-12-11 00:12:48,400 INFO sqlalchemy.engine.base.Engine {}
2021-12-11 00:12:48,401 INFO sqlalchemy.engine.base.Engine show collation where `Charset` = 'utf8mb4' and `Collation` = 'utf8mb4_bin'
2021-12-11 00:12:48,402 INFO sqlalchemy.engine.base.Engine {}
2021-12-11 00:12:48,403 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
2021-12-11 00:12:48,404 INFO sqlalchemy.engine.base.Engine {}
2021-12-11 00:12:48,405 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
2021-12-11 00:12:48,405 INFO sqlalchemy.engine.base.Engine {}
2021-12-11 00:12:48,406 INFO sqlalchemy.engine.base.Engine SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8mb4) COLLATE utf8mb4_bin AS anon_1
2021-12-11 00:12:48,407 INFO sqlalchemy.engine.base.Engine {}
2021-12-11 00:12:48,408 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `my-company`
2021-12-11 00:12:48,408 INFO sqlalchemy.engine.base.Engine {}

['Abteilung',
 'Arbeitspaket',
 'Arbeitspaketbeziehung',
 'Buchung',
 'Kompetenz',
 'Kunde',
 'Mitarbeiter',
 'Projekt',
 'Tätigkeit',
 'customerr']

In [38]:
df = pd.read_sql('Select id, apid from Buchung', engine)

2021-12-11 00:12:49,032 INFO sqlalchemy.engine.base.Engine DESCRIBE `Select id, apid from Buchung`
2021-12-11 00:12:49,033 INFO sqlalchemy.engine.base.Engine {}
2021-12-11 00:12:49,033 INFO sqlalchemy.engine.base.Engine ROLLBACK
2021-12-11 00:12:49,035 INFO sqlalchemy.engine.base.OptionEngine Select id, apid from Buchung
2021-12-11 00:12:49,035 INFO sqlalchemy.engine.base.OptionEngine {}

In [39]:
df

          id  apid
0      33097     1
1      33127     1
2      33157     1
3      33212     1
4      33220     1
...      ...   ...
62944  53009   257
62945  53063   257
62946  53580   257
62947  53585   257
62948  53707   257

[62949 rows x 2 columns]